Revit 2022 API
IFCFileWriteOptions Properties
The IFCFileWriteOptions type exposes the following members.
Properties
Name | Description
FileFormat
 The file format of the IFC file.
FileName
 The full file name of the IFC file to be written.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
XMLConfigFileName
 The XML configuration file name. It is used only for writing IFC-XML format file.
See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace